Tekla Open API Reference for Tekla Structures 2025
DPMPrinterAttributes Properties
The DPMPrinterAttributes type exposes the following members.
Properties
Name | Description
ColorMode
 Output color mode.
NumberOfCopies
 The number of copies of each drawing to print. Only applicable for printing to a printer.
OpenFileWhenFinished
 Whether to open file when finished.
Orientation
 The print orientation type.
OutputFileName
 Output file name and path. Applicable in PDF printing.
OutputType
 The printing output type.
PaperSize
 The paper size name.
PrinterName
 The printer name.
PrintToMultipleSheet
 Whether to print to multiple sheets.
ScaleFactor
 The print scale factor.
ScalingMethod
 The print scaling method.
Top
See Also
Reference
DPMPrinterAttributes Class
Tekla.Structures.Drawing Namespace